Tekla.Structures.DrawingInternal.dotGrStraightDimension_t


Tekla.Structures.DrawingInternal.dotGrStraightDimension_t.DimensionBase


Tekla.Structures.DrawingInternal.dotGrStraightDimension_t.Attributes


Tekla.Structures.DrawingInternal.dotGrStraightDimension_t.DimSetAttributes


Tekla.Structures.DrawingInternal.dotGrStraightDimension_t.Distance


Tekla.Structures.DrawingInternal.dotGrStraightDimension_t.UpDirection


Tekla.Structures.DrawingInternal.dotGrStraightDimension_t.Mark


Tekla.Structures.DrawingInternal.dotGrStraightDimension_t.StartPoint


Tekla.Structures.DrawingInternal.dotGrStraightDimension_t.EndPoint


Tekla.Structures.DrawingInternal.dotGrStraightDimension_t.PreferredStartPointRuleId


Tekla.Structures.DrawingInternal.dotGrStraightDimension_t.PreferredEndPointRuleId


Tekla.Structures.DrawingInternal.dotGrStraightDimension_t.PreferredZeroPointRuleId


Tekla.Structures.DrawingInternal.dotGrStraightDimension_t.ToStruct(Tekla.Structures.Drawing.StraightDimension)


Tekla.Structures.DrawingInternal.dotGrStraightDimension_t.FromStruct(Tekla.Structures.Drawing.StraightDimension)
